tap "koekeishiya/formulae"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Multi-shell multi-command argument completer
brew "carapace"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Package manager for kubectl plugins
brew "krew"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Asynchronous event library
brew "libevent"
# Portable library for network traffic capture
brew "libpcap"
# Generic library support script
brew "libtool"
# Package manager for the Lua programming language
brew "luarocks"
# Run a Kubernetes cluster locally
brew "minikube"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Prometheus exporter for machine metrics
brew "node_exporter"
# Highly capable, feature-rich programming language
brew "perl"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Declarative pure-SQL schema management for MySQL and MariaDB
brew "skeema"
# SOcket CAT: netcat on steroids
brew "socat"
# Generate type safe Go from SQL
brew "sqlc"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Maintained ctags implementation
brew "universal-ctags"
# HTTP load testing tool and library
brew "vegeta"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# GPU-accelerated terminal emulator
cask "alacritty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Display management tool
cask "betterdisplay"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Web browser
cask "firefox@developer-edition"
cask "font-jetbrains-mono-nerd-font"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Provides access to camera controls
cask "logitech-camera-settings"
# Optimise your webcam, headset, and Logi Dock for video meetings
cask "logitune"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Development environment
cask "vagrant"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark-app"
go "github.com/air-verse/air"
go "github.com/BrianGreenhill/coachgpt"
go "github.com/spf13/cobra-cli"
go "golang.org/x/tools/gopls"
go "github.com/box/memsniff"
go "github.com/golang/mock/mockgen"
go "github.com/briangreenhill/ssg"
go "honnef.co/go/tools/cmd/staticcheck"
