tap "homebrew/bundle"
brew "bat"
brew "direnv"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "luarocks"
brew "neovim"
brew "node"
brew "ripgrep"
brew "stow"
brew "telnet"
brew "tmux"
brew "tree"
brew "wget"
brew "zoxide"
cask "alacritty"
cask "alt-tab"
cask "betterdisplay"
cask "firefox@developer-edition"
cask "font-jetbrains-mono-nerd-font"
cask "gpg-suite-no-mail"
cask "hiddenbar"
cask "itsycal"
cask "obsidian"
cask "orbstack"
cask "stats"
