brew "coreutils"
brew "moreutils"
brew "findutils"
brew "z"
brew "git"
brew "zsh"
brew "tree"
brew "watch"
brew "htop"
brew "telnet"
brew "fzf"

brew "gpg"
brew "gpg2"
brew "go"
brew "mockery"
brew "rbenv"
brew "python3"
brew "asdf"
brew "tmux"
brew "gh"

tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"

tap "neovim/neovim"
brew "neovim", args: ["HEAD"]

cask "alfred"
cask "zoom"
cask "kitty"
cask "spotify"
cask "telegram"
cask "google-chrome"
cask "slack"
